#Расстояние в метрах
#Напишите программу, которая находит полное число метров по заданному числу сантиметров.

s = int(input())

m = s // 100

print(m)