#Три последовательных числа
#Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке. Первое число вводит пользователь, остальные числа вычисляются в программе.

a = input()

b = int(a) + 1
c = int(b) + 1

print(a)
print(b)
print(c)