#Стоимость покупки
#Напишите программу, которая считает стоимость трех компьютеров, состоящих из монитора, системного блока, клавиатуры и мыши.

a = int(input())
b = int(input())
c = int(input())
d = int(input())

Summ = (a + b + c + d) * 3

print(Summ)